package org.example.spacecore.bot.util

import org.example.spacecore.bot.model.Gender
import org.example.spacecore.bot.model.Vibe
import org.example.spacecore.bot.service.ProfileService
import org.telegram.telegrambots.meta.api.objects.User

val femaleNames = arrayOf(
    "Александра", "Алина", "Алиса", "Алла", "Анастасия", "Ангелина", "Анна", "Антонина", "Арина",
    "Валентина", "Валерия", "Варвара", "Василиса", "Вера", "Вероника", "Виктория", "Галина", "Дарья",
    "Диана", "Ева", "Евгения", "Екатерина", "Елена", "Елизавета", "Жанна", "Злата", "Зоя", "Ирина",
    "Кира", "Клавдия", "Кристина", "Ксения", "Лариса", "Лидия", "Лилиана", "Лилия", "Любовь", "Людмила",
    "Маргарита", "Марина", "Мария", "Милана", "Надежда", "Наталья", "Нина", "Оксана", "Олеся", "Ольга",
    "Полина", "Раиса", "Регина", "Римма", "Светлана", "София", "Таисия", "Тамара", "Татьяна", "Ульяна",
    "Эвелина", "Эльвира", "Эмилия", "Юлия", "Яна", "Агата", "Агния", "Аделаида", "Аделина", "Азиза",
    "Айгуль", "Айлин", "Айша", "Аксинья", "Алевтина", "Алёна", "Алмаз", "Альбина", "Амалия", "Амелия",
    "Амина", "Амира", "Анаит", "Анжела", "Анжелика", "Анисья", "Анфиса", "Ариадна", "Арьяна", "Асель",
    "Асия", "Ассоль", "Аурелия", "Белла", "Богдана", "Василина", "Венера", "Владислава", "Гелена",
    "Глафира", "Гузель", "Дана", "Даниэла", "Дина", "Динара", "Евдокия", "Евлампия", "Екатерина",
    "Есения", "Жасмин", "Зарина", "Земфира", "Зоряна", "Иванна", "Изабелла", "Илона", "Инга", "Инесса",
    "Ия", "Камилла", "Карина", "Каролина", "Катерина", "Кира", "Клара", "Клементина", "Констанция",
    "Корнелия", "Кристина", "Лада", "Лейла", "Леонида", "Леся", "Лина", "Любава", "Людмила", "Магдалина",
    "Майя", "Марта", "Матрёна", "Мелания", "Милена", "Мирослава", "Мирра", "Наталия", "Нелли", "Ника",
    "Николь", "Нонна", "Нора", "Октавия", "Павла", "Пелагея", "Прасковья", "Рада", "Радмила", "Рената",
    "Роза", "Роксана", "Руслана", "Сабина", "Саида", "Самира", "Сара", "Сафия", "Светлана", "Селена",
    "Серафима", "Симона", "Снежана", "Станислава", "Стефания", "Сусанна", "Тереза", "Устинья", "Фаина",
    "Фатима", "Федора", "Фелиция", "Флора", "Фрида", "Христина", "Цветана", "Эдита", "Элеонора", "Элина",
    "Элла", "Эльза", "Эмма", "Юлиана", "Юниесса", "Ядвига", "Ярослава", "Абабил", "Аббаса", "Абигайль",
    "Абида", "Абила", "Абра", "Абрия", "Ава", "Аваз", "Аваль", "Авва", "Августа", "Авдотья", "Авелина",
    "Аверьяна", "Аврора", "Агапия", "Агарь", "Агата", "Агафья", "Агга", "Агнесса", "Агния", "Аграфена",
    "Ада", "Аделаида", "Аделина", "Адель", "Адиля", "Адиса", "Адриана", "Аза", "Азалия", "Азиза",
    "Аида", "Аиша", "Айана", "Айбике", "Айгуль", "Айдан", "Айжан", "Айлин", "Айна", "Айнур", "Айсель",
    "Айсылу", "Айтач", "Айшат", "Акалина", "Акилина", "Аксинья", "Акулина", "Алана", "Алба", "Албина",
    "Алевтина", "Александра", "Алена", "Алима", "Алина", "Алиса", "Алия", "Алла", "Алма", "Алсу",
    "Альба", "Альберта", "Альбина", "Альвина", "Альфия", "Альфреда", "Амалия", "Амаль", "Амелия",
    "Амина", "Амира", "Анабела", "Анастасия", "Ангела", "Ангелина", "Анджела", "Анеля", "Анжела",
    "Анжелика", "Анисия", "Анита", "Анна", "Антонина", "Анфиса", "Аполлинария", "Арабелла", "Ариадна",
    "Ариана", "Арина", "Арьяна", "Асель", "Асида", "Асия", "Ассоль", "Астра", "Ася", "Аурелия",
    "Афанасия", "Аэлита", "Аюна", "Бажена", "Беата", "Беатрис", "Белла", "Береслава", "Берта",
    "Богдана", "Божена", "Бронислава", "Валентина", "Валерия", "Ванда", "Варвара", "Василина",
    "Василиса", "Васса", "Венера", "Вера", "Вероника", "Веселина", "Весна", "Вида", "Викторина",
    "Виктория", "Вилена", "Виола", "Виргиния", "Вита", "Виталина", "Влада", "Владислава", "Владлена",
    "Всеслава", "Габриэлла", "Галина", "Гаяне", "Гелена", "Гелиана", "Гелла", "Генриетта", "Георгина",
    "Гера", "Гертруда", "Глафира", "Глория", "Горислава", "Грета", "Гулия", "Гульназ", "Гульнара",
    "Гюзель", "Дана", "Даниэла", "Дара", "Дарина", "Дарья", "Дебора", "Джамиля", "Джемма", "Диана",
    "Дина", "Динара", "Дита", "Доминика", "Дора", "Ева", "Евангелина", "Евгения", "Евдокия",
    "Екатерина", "Елена", "Елизавета", "Есения", "Жанна", "Жасмин", "Жозефина", "Забава", "Заира",
    "Зара", "Зарема", "Зарина", "Захария", "Земфира", "Зинаида", "Злата", "Зоряна", "Зульфия",
    "Зухра", "Ивана", "Иветта", "Ида", "Изабелла", "Изольда", "Илга", "Илона", "Ильзира", "Инга",
    "Инесса", "Инна", "Иоанна", "Иоланта", "Ираида", "Ирина", "Ирма", "Искра", "Ия", "Калерия",
    "Камилла", "Капитолина", "Карина", "Каролина", "Катерина", "Кира", "Клавдия", "Клара", "Клариса",
    "Клементина", "Клеопатра", "Констанция", "Кора", "Корнелия", "Кристина", "Ксения", "Лада",
    "Лариса", "Лейла", "Лена", "Леокадия", "Леонида", "Леонтия", "Леся", "Лиана", "Лидия", "Лика",
    "Лилиана", "Лилия", "Лина", "Лолита", "Луиза", "Лукерья", "Лукия", "Любава", "Любовь", "Любомила",
    "Людмила", "Люсьена", "Люция", "Мавра", "Мадина", "Майя", "Макрина", "Малания", "Малика",
    "Маргарита", "Марианна", "Марина", "Мария", "Марта", "Марфа", "Марьям", "Мастридия", "Матрена",
    "Мелания", "Мелисса", "Милада", "Милана", "Милена", "Милица", "Милослава", "Мира", "Мирослава",
    "Мирра", "Моника", "Мстислава", "Муза", "Надежда", "Наталья", "Нелли", "Неонила", "Ника",
    "Николь", "Нина", "Нинель", "Ноами", "Нонна", "Нора", "Оксана", "Октавия", "Олеся", "Ольга",
    "Павла", "Пелагея", "Полина", "Прасковья", "Рада", "Радмила", "Раиса", "Раяна", "Регина",
    "Рената", "Римма", "Рина", "Рита", "Рогнеда", "Роза", "Роксана", "Ростислава", "Рузана",
    "Румия", "Русалина", "Руслана", "Руфина", "Сабина", "Саида", "Саломея", "Самира", "Санта",
    "Сара", "Сафия", "Светлана", "Святослава", "Севара", "Северина", "Светозара", "Селена", "Серафима",
    "Сильвия", "Сима", "Симона", "Снежана", "Соня", "Софья", "Станислава", "Стелла", "Степанида",
    "Стефания", "Сусанна", "Таисия", "Тамара", "Тамила", "Татьяна", "Теона", "Тереза", "Тина",
    "Томила", "Ульяна", "Урсула", "Устинья", "Фаина", "Фатима", "Феврония", "Федора", "Фекла",
    "Фелиция", "Феодора", "Флора", "Флоренция", "Франческа", "Фрида", "Хадия", "Харитина", "Хильда",
    "Христина", "Цветана", "Челси", "Чеслава", "Эвелина", "Эдита", "Элеонора", "Элиза", "Элина",
    "Элла", "Эльвира", "Эльга", "Эльза", "Эльмира", "Эмилия", "Эмма", "Эрика", "Эсмеральda",
    "Юлиана", "Юлия", "Юна", "Юния", "Юнона", "Ядвига", "Яна", "Янина", "Ярослава", "Ясна",
    "Агнешка", "Адела", "Аделия", "Адита", "Адриенна", "Айла", "Акико", "Аланис", "Алдона", "Алексия",
    "Алисия", "Алма", "Алтэя", "Амада", "Амалия", "Амбэр", "Амели", "Анабель", "Анаи", "Анаис",
    "Андреа", "Анжелик", "Анн", "Аннабель", "Аннемари", "Аннет", "Антониетта", "Анушка", "Аполлония",
    "Арабелла", "Ариэль", "Арлет", "Армель", "Армида", "Арсентия", "Арья", "Асель", "Асия", "Астрид",
    "Атена", "Аурика", "Афродита", "Аша", "Бабита", "Барбара", "Беатриче", "Белла", "Беренис",
    "Берта", "Бетти", "Бианка", "Бланка", "Богдана", "Божена", "Бриджит", "Бронислава", "Ванесса",
    "Варя", "Василиса", "Венди", "Вероника", "Вивьен", "Виктория", "Виолетта", "Вита", "Власта",
    "Габриэла", "Галина", "Гелла", "Гертруда", "Грета", "Гульмира", "Даниэла", "Дарья", "Делия",
    "Деми", "Дженна", "Джессика", "Джина", "Джоан", "Джоди", "Джорджина", "Диана", "Дина", "Долорес",
    "Доминика", "Дора", "Ева", "Евгения", "Екатерина", "Елена", "Елизавета", "Жаклин", "Жанна")

    class AddUtil {
    companion object{
        fun generateAngels(profileService: ProfileService){

            for (i in (0..50)) {
                profileService.getOrCreateProfile(User.builder().id(i.toLong()).firstName(femaleNames.random()+"$i").lastName("").userName("ilduseps").isBot(false).build())
                profileService.updateAge(i.toLong(), 22 + (0..8).random() - 4)
                profileService.updateVibe(i.toLong(), Vibe.fromInt((0..9).random()))
                profileService.updateGender(i.toLong(), Gender.FEMALE)
                profileService.updateLookingFor(i.toLong(), Gender.MALE)
                profileService.updateActivityStatus(i.toLong(), true)
                profileService.updatePhoto(i.toLong(), listOf("AgACAgIAAxkBAAIB02jOfIWf2G4O66rNscMoENQOhC0BAAP8MRvVT3lKeb1DToF_Pc0BAAMCAAN5AAM2BA", "AgACAgIAAxkBAAIDkmjPt3mY_Fem-7CrQNkU8MvVEdJCAALD9zEb1U-BSkqpxmC_YPHFAQADAgADeAADNgQ", "AgACAgIAAxkBAAIExWjRgYyIgklxR724OlfkzpIaaY5MAALe_TEbYF6QSrgfscXp6lFBAQADAgADeAADNgQ", "AgACAgIAAxkBAAIEyGjRgd6zs8OlXbcBj3XJi0mtuqS1AALg_TEbYF6QSsza2k3kMEgTAQADAgADeQADNgQ", "AgACAgIAAxkBAAIEy2jRgijZifDOkJHFbnHcVhQuMqnaAALk_TEbYF6QShM_VzbdG3DBAQADAgADeQADNgQ").random())
                profileService.updateDescription(i.toLong(), listOf("Я бы любила тебя долго-долго!", "Люблю страстно!")[(0..1).random()])
            }
        }
    }
}